rails/app/controllers/api/v1/articles_controller.rb

SELECT "articles".* FROM "articles"
---
      def index
        render json: {"article" => Article.all.as_json(root: false) }.to_json

SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", "create"]]
---
      def show
        render json: {"article" => Article.find(params[:id]).as_json(root: false) }.to_json

INSERT INTO "articles" ("author", "content", "created_at", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author", "b"], ["content", "<DS.RecordArray:ember367>"], ["created_at", Mon, 26 Oct 2015 21:17:39 CDT -05:00], ["title", "a"], ["updated_at", Mon, 26 Oct 2015 21:17:39 CDT -05:00]]
---
      def create
        @article = Article.new(article_params)

        if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", "2"]]
UPDATE "articles" SET "contents" = $1, "updated_at" = $2 WHERE "articles"."id" = 2  [["contents", "blah blah blah...BLAH"], ["updated_at", Sat, 31 Oct 2015 10:48:45 CDT -05:00]]
---
      def update
        @article = Article.find(params[:id])

        if @article.update(article_params)