rails/app/controllers/api/v1/projects_controller.rb

SELECT "projects".* FROM "projects"
---
      def index
        render json: {"project" => Project.all.as_json(root: false) }.to_json

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]
---
      def show
        render json: {"project" => Project.find(params[:id]).as_json(root: false) }.to_json